
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РеализацияРабот Расход
	Движения.РеализацияРабот.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.РеализацияРабот.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		Движение.Часы = ТекСтрокаУслуги.Трудоемкость;
	КонецЦикла;

	// регистр ВзаиморассчетыССотрудниками 
	Движения.ВзаиморассчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ВзаиморассчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаУслуги.Сотрудник;
		Движение.Часы = ТекСтрокаУслуги.ФактТрудоемкость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Проект") Тогда
		// Заполнение шапки
		Проект = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияРаботОстатки.ЧасыОстаток КАК ЧасыОстаток
				|ИЗ
				|	РегистрНакопления.РеализацияРабот.Остатки(
				|			,
				|			Проект = &Проект
				|				И Номенклатура = &Номенклатура) КАК РеализацияРаботОстатки";
			
			Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаУслуги.Номенклатура);
			Запрос.УстановитьПараметр("Проект", ДанныеЗаполнения.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			СуммаЧасов = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СуммаЧасов = СуммаЧасов + ВыборкаДетальныеЗаписи.ЧасыОстаток;
			КонецЦикла;
	
			Если СуммаЧасов = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			НоваяСтрока.Трудоемкость = СуммаЧасов;
			НоваяСтрока.ТрудоемкостьЭталон = СуммаЧасов;
			НоваяСтрока.ФактТрудоемкость = СуммаЧасов;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
