
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВзаиморассчетыССотрудниками Расход
	Движения.ВзаиморассчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаРасчет Из Расчет Цикл
		Движение = Движения.ВзаиморассчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаРасчет.Сотрудник;
		Движение.Часы = ТекСтрокаРасчет.ОтработанноеВремя;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
