

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проект.Ссылка КАК Ссылка,
		|	Проект.ДанаНачала КАК ДанаНачала,
		|	Проект.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.Проект КАК Проект";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Ссылка);
		Серия = ДиаграммаГанта.УстановитьСерию(0);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		ДиаграммаГанта.ОтображатьЛегенду = Ложь;
		
		Интервал = Значение.Добавить();
		СвязьИнтервалНачало = Интервал; 
		Интервал.Начало = ВыборкаДетальныеЗаписи.ДанаНачала;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ДатаОкончания;		

	КонецЦикла;	
	
КонецПроцедуры

