
&НаСервере
Процедура ПроектСогласованНаСервере()
	Объект.СтатусПроекта = Перечисления.СтатусыПроекта.ВРаботе;
	Элементы.ФормаПроектСогласован.Доступность = Ложь;
	Если РольДоступна("Администратор") Тогда
		Элементы.Услуги.Доступность = Истина;
	Иначе
	    Элементы.Услуги.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроектСогласован(Команда)
	ПроектСогласованНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	//Проверка оплат
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредства.Проект КАК Проект,
		|	ДенежныеСредства.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства";
	
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Объект.Оплачено = 0;
	
	Для каждого СтрокаОплаты из ВыборкаДетальныеЗаписи Цикл
		Если СтрокаОплаты.Проект = Объект.Ссылка Тогда
			Объект.Оплачено = Объект.Оплачено + СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Сумма > Объект.Оплачено Тогда
		Разность = Объект.Сумма - Объект.Оплачено;
		Элементы.ДолженНам.Заголовок = "Должен нам " + Разность + " руб.";	
		Элементы.ДолженНам.ЦветТекста = WebЦвета.Красный;
	ИначеЕсли Объект.Сумма = Объект.Оплачено Тогда
		Элементы.ДолженНам.Заголовок = "Полностью оплатил проект.";
		Элементы.ДолженНам.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли Объект.Сумма < Объект.Оплачено Тогда
		Разность = Объект.Оплачено - Объект.Сумма;
		Элементы.ДолженНам.Заголовок = "Переплатил " + Разность + " руб.";	
		Элементы.ДолженНам.ЦветТекста = WebЦвета.Оранжевый;
	КонецЕсли;
		
	Если Объект.Оплачено > 0 Тогда
		Объект.СтатусОплаты = Перечисления.СтатусыОплаты.ЧастичноОплачен;
	КонецЕсли;
	
	Если Объект.Оплачено >= Объект.Сумма Тогда
		Объект.СтатусОплаты = Перечисления.СтатусыОплаты.Оплачен;
	КонецЕсли;
	
	Если Объект.Оплачено = 0 Тогда
		Объект.СтатусОплаты = Перечисления.СтатусыОплаты.НеОплачен;
	КонецЕсли;

	
	//Статус меняется на завершен, если задачи все закрыты, добавляется возможность закрыть проект	
	Если Объект.СтатусПроекта.Пустая() Тогда
		Объект.СтатусПроекта = Перечисления.СтатусыПроекта.НаСогласовании;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияРаботОстатки.Номенклатура КАК Номенклатура,
		|	РеализацияРаботОстатки.ЧасыОстаток КАК ЧасыОстаток
		|ИЗ
		|	РегистрНакопления.РеализацияРабот.Остатки(, Проект = &Проект) КАК РеализацияРаботОстатки";
	
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Объект.СтатусПроекта = Перечисления.СтатусыПроекта.ВРаботе Тогда
		Если РезультатЗапроса.Пустой() Тогда
			Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Завершен;
			Элементы.ФормаЗакрытьПроект.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	
	
	Если Объект.СтатусПроекта = Перечисления.СтатусыПроекта.НаСогласовании Тогда
		Элементы.ФормаПроектСогласован.Доступность = Истина;
		Элементы.Услуги.Доступность = Истина;
	ИначеЕсли Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Завершен Тогда
		Элементы.ФормаЗакрытьПроект.Доступность = Истина;
	ИначеЕсли Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Закрыт Тогда	
		Если РольДоступна("Администратор") Тогда
			ЭтаФорма.Доступность = Истина;
			Элементы.Услуги.Доступность = Истина;
		Иначе
		    ЭтаФорма.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если РольДоступна("Администратор") Тогда
		ЭтаФорма.Доступность = Истина;
		Элементы.Услуги.Доступность = Истина;
		Элементы.СтатусОплаты.Доступность = Истина;
		Элементы.СтатусПроекта.Доступность = Истина;
	КонецЕсли;		
	
	Если Объект.Сумма = 0 Тогда
		Элементы.ДолженНам.Видимость = Ложь;		
	КонецЕсли;
	
	ОбновитьНаСервере();
	
	КонецПроцедуры

&НаСервере
Функция УслугиНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Цена = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цена = ВыборкаДетальныеЗаписи.Цена;	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат Цена;	
КонецФункции

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;	
	Цена =	УслугиНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура);
	ТекСтрока.Цена = Цена;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиТрудоемкостьПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Цена = ТекСтрока.Сумма / ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПроектНаСервере()
	Если Объект.СтатусОплаты = Перечисления.СтатусыОплаты.Оплачен Тогда
		Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Закрыт;
	Иначе
		Сообщить("Невозможно закрыть проект. Проект не оплачен.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПроект(Команда)
	ЗакрытьПроектНаСервере();
КонецПроцедуры

&НаСервере
Процедура АнализСроковНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура АнализСроков(Команда)
	АнализСроковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ДиаграммаГанта.Очистить();
	Для каждого СтрокаУслуги из Объект.Услуги Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаУслуги.Номенклатура);
		Серия = ДиаграммаГанта.УстановитьСерию(0);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		ДиаграммаГанта.ОтображатьЛегенду = Ложь;
		
		Интервал = Значение.Добавить();
		СвязьИнтервалНачало = Интервал; 
		Интервал.Начало = СтрокаУслуги.ДатаНачала;
		Интервал.Конец = СтрокаУслуги.ДатаОкончания;				
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаНачалаПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаОкончанияПриИзменении(Элемент)
	ОбновитьНаСервере();              
КонецПроцедуры
