
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Расчет.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСотрудников = РезультатЗапроса.Выгрузить();		
	
	//Цикл по всем сотрудникам
	Для Каждого СтрокаСотрудника из ВыборкаСотрудников Цикл
		
		Сотрудник = СтрокаСотрудника.Ссылка;
		Ставка = Сотрудник.ОплатаВЧас;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВзаиморассчетыССотрудникамиОстатки.ЧасыОстаток КАК ЧасыОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморассчетыССотрудниками.Остатки(, Сотрудник = &Сотрудник) КАК ВзаиморассчетыССотрудникамиОстатки";
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ЧасыСотрудника = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЧасыСотрудника = ВыборкаДетальныеЗаписи.ЧасыОстаток + ЧасыСотрудника;	
		КонецЦикла;
	
		Если ЧасыСотрудника = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Расчет.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник;
		НоваяСтрока.Ставка = Ставка;
		НоваяСтрока.ОтработанноеВремя = ЧасыСотрудника;
		НоваяСтрока.Сумма = Ставка * ЧасыСотрудника;		
	КонецЦикла;
	
	
	Объект.Сумма = Объект.Расчет.Итог("Сумма");
	
	Итог = Объект.Расчет.Количество();
	Если Итог = 0 Тогда
		Сообщить("Нет сотрудников для выплаты зарплаты");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РасчетСтавкаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Ставка * ТекСтрока.ОтработанноеВремя;
	Объект.Сумма = Объект.Расчет.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Ставка = ТекСтрока.Сумма / ТекСтрока.ОтработанноеВремя;
	Объект.Сумма = Объект.Расчет.Итог("Сумма");
КонецПроцедуры
